Австралия/src/InformationRegisters/ProcessesToStart/ProcessesToStart.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProcessesToStart</name>
  <resources>
    <name>DeferredStartDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>State</name>
    <type>
      <types>EnumRef.ProcessesStatesForStart</types>
    </type>
  </resources>
  <attributes>
    <name>StartCancelReason</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Owner</name>
    <type>
      <types>DefinedType.DeferredBusinessProcess</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/ProcessesStatesForStart/ProcessesStatesForStart.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProcessesStatesForStart</name>
  <enumValues>
    <name>ReadyToStart</name>
  </enumValues>
  <enumValues>
    <name>StartCanceled</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/InformationRegisters/ProcessesToStart/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// Adds information about successful process start.
//
// Parameters:
//   - BusinessProcess - BusinessProcessRef.
//
Procedure RegisterProcessStart(Process) Export
	
	Record = CreateRecordManager();
	Record.Owner = Process;
	Record.Read();
	
	If Not Record.Selected() Then
		Return;
	EndIf;
	
	Record.Delete();
	
EndProcedure

// Adds information about process start cancellation.
//
// Parameters:
//   - BusinessProcess - BusinessProcessRef.
//
Procedure RegisterStartCancellation(Process, CancellationReason) Export
	
	Record = CreateRecordManager();
	Record.Owner = Process;
	Record.Read();
	
	If Not Record.Selected() Then
		Return;
	EndIf;
	
	Record.State = Enums.ProcessesStatesForStart.StartCanceled;
	Record.StartCancelReason = CancellationReason;
	
	Record.Write();
	
EndProcedure

#EndRegion

#EndIf
